import {defineConfig} from 'vitepress'
import {set_sidebar} from "../utils/auto_sidebar.mjs";

// https://vitepress.dev/reference/site-config
export default defineConfig({
    // 忽略死链接检查，避免构建失败
    ignoreDeadLinks: true,
    title: "宇豪Note💗",
    description: "A VitePress Site",
    themeConfig: {
        head: [
            ["link", {rel: "icon", href: "/img/img.png"}]
        ],
        // sidebar: true, // 关闭侧边栏
        // aside: "left", // 设置右侧侧边栏在左侧显示
        outlineTitle: "目录",
        outline: [2 - 6],
        // https://vitepress.dev/reference/default-theme-config
        logo: '/img/title.png',
        // logo:'",
        // 导航配置
        nav: [
            // text为导航栏显示文字，link为路径，即文件夹名字，注意不要丢了名字前后的'/'
            // {text: '首页', link: '/'},

            {
                text: '关于我',
                items: [
                    {
                        text: '关于网站', link: '/AboutMe/关于网站.md',
                    },
                    {
                        text: '关于经历', link: '/AboutMe/关于经历/关于经历.md',
                    },
                    {
                        text: '关于爱好', link: '/AboutMe/关于爱好.md',
                    },
                    {
                        text: '关于她', link: '/AboutMe/关于她.md',
                    },
                ]
            },
            {
                text: 'java开发',
                items: [{
                    text: '入门',
                    items: [
                        {text: '写在前面', link: '/java后端/入门/java基础/README.md'},
                        {text: 'javaSE基础', link: '/java后端/入门/java基础/动力节点/JavaSE进阶-01-面向对象.md'},
                        {text: 'java网络编程', link: '/java后端/入门/java网络编程/狂神/JavaSE：网络编程.md'},
                        {text: 'java-GUI开发', link: '/java后端/入门/javaGUI编程/狂神/javaGUI编程.md'},
                        {text: 'JavaWeb', link: '/java后端/入门/javaWeb/黑马/01HTTP&Tomcat&Servlet.md'},
                        {text: 'Spring', link: '/java后端/入门/Spring/狂神/Spring.md'},
                        {text: 'SpringMVC', link: '/java后端/入门/SpringMVC/狂神/SpringMVC.md'},
                        {text: 'SpringBoot', link: '/java后端/入门/SpringBoot/狂神/SpringBoot入门及原理.md'},
                    ]
                },
                    {
                        text: '接口文档Swagger(可作了解)',
                        items: [
                            {text: 'Swagger', link: '/java后端/入门/SpringBoot/狂神/Swagger.md'},
                        ]
                    },
                    {
                        text: '数据库&框架',
                        items: [
                            {text: 'mysql', link: '/数据库/mysql/sql-个人.md'},
                            {text: 'JDBC驱动', link: '/java后端/java数据库框架/jdbc-黑马.md'},
                            {text: 'mybatis框架', link: '/java后端/java数据库框架/mybatis-狂神.md'},
                            {text: 'mybatis-plus框架', link: '/java后端/java数据库框架/mybatis-plus01-黑马.md'},
                        ]
                    },

                    {
                        text: '权限框架',
                        items: [
                            {text: '写在前面', link: '/java后端/权限框架/README.md'},
                            {text: 'SpringSecurity', link: '/java后端/权限框架/SpringSecurity/狂神/SpringSecurity.md'},
                            {text: 'Shiro', link: '/java后端/权限框架/Shiro/狂神/Shiro.md'},
                        ]
                    },
                    {
                        text: '进阶SpringCloud',
                        items: [
                            {
                                text: '写在前面',
                                link: '/java后端/SpringCloud/README.md'
                            },
                            {
                                text: '注册中心nacos&Eureka',
                                link: '/java后端/SpringCloud/注册中心nacos&Eureka/动力节点/nacos注册中心.md'
                            },
                            {text: '网关Gateway', link: '/java后端/SpringCloud/网关Gateway/动力节点/Gateway.md'},
                            {text: '负载均衡Ribbon', link: '/java后端/SpringCloud/负载均衡Ribbon/动力节点/Ribbon.md'},
                            {
                                text: '熔断降级Hystrix&sentinel',
                                link: '/java后端/SpringCloud/熔断降级Hystrix&sentinel/动力节点/Hystrix.md'
                            },
                            {
                                text: '远程调用OpenFeign',
                                link: '/java后端/SpringCloud/远程调用OpenFeign/动力节点/OpenFeign.md'
                            },
                            {text: '链路追踪sleuth', link: '/java后端/SpringCloud/链路追踪sleuth/动力节点/Sleuth.md'},
                            {
                                text: '分布式搜索ElasticSerach',
                                link: '/java后端/SpringCloud/分布式搜索ElasticSerach/狂神/ElasticSearch.md'
                            },
                            {text: '消息队列RabbitMQ', link: '/java后端/SpringCloud/消息队列RabbitMQ/飞哥/RabbitMQ.md'},
                        ]
                    },
                    {
                        text: '消息通信协议MQTT',
                        items: [
                            {text: 'MQTT入门', link: '/java后端/mqtt/第一章【MQTT入门】.md'},
                            {text: 'MQTT进阶', link: '/java后端/mqtt/第二章【MQTT进阶】.md'},
                            {text: 'MQTT Dashboard', link: '/java后端/mqtt/第三章【MQTT Dashboard】.md'},
                            {text: 'MQTT SDK以及实战', link: '/java后端/mqtt/第四章【MQTT SDK以及实战】.md'},
                        ]
                    },
                    {
                        text: '高级',
                        items: [
                            {text: '写在前面', link: '/java后端/高级/README.md'},
                            {text: 'jvm内存', link: '/java后端/高级/jvm/黑马/引言.md'},
                            {text: 'juc并发编程', link: '/java后端/高级/juc/黑马/01并发编程.md'},
                        ]
                    },
                ]
            },
            {
                text: '前端开发',
                items: [
                    {
                        text: '写在前面',
                        link: '/前端/README.md',
                    },
                    {
                        text: '基础-(前端三件套)',
                        items: [
                            {text: 'HTML', link: '/前端/基础/HTML/黑马/HTML标签.md'},
                            {text: 'CSS', link: '/前端/基础/CSS/黑马/01-CSS.md'},
                            {text: 'JavaScript', link: '/前端/基础/JavaScript/黑马/'},
                            {text: 'jQuery', link: '/前端/基础/jQuery/黑马/01-jQuery常用API.md'},
                            {text: '移动端开发', link: '/前端/基础/CSS/移动端/02_HTML5.md'},
                        ]
                    },
                    {
                        text: '入门',
                        items: [
                            {text: '入门串讲', link: '/前端/入门/入门串讲/狂神/大前端串讲.md'},
                            {text: 'Vue框架', link: '/前端/入门/Vue/狂神/Vue精讲.md'},
                        ]
                    },
                ]
            },
            /*{
                text: 'python开发',
                items: [
                    {
                        text: '写在前面',
                        link: '/python/README.md',

                    },
                    {
                        text: '入门',
                        items: [
                            {text: 'python基础', link: '/python/python_base'},
                        ]
                    },
                    {
                        text: 'odoo框架', items: [
                            {text: '快速入门', link: '/odoo/odoo_base/guide'},
                            {text: '核心开发', link: '/odoo/odoo_core/orm.md'},
                            {text: '报表', link: '/odoo/odoo_core/report.md'},
                            {text: '挂件', link: '/odoo/pendant.md'},
                        ]
                    },
                ]
            },*/
            {
                text: '大数据',
                items: [
                    {text: '写在前面', link: '/bigdata/README.md'},
                    {text: 'Hbase', link: '/bigdata/hbase/hbase'},
                    // {text: 'Hadoop', link: '/bigdata/hadoop/hadoop'}
                ]
            },
            {
                text: '数据库',
                items: [
                    {
                        text: '写在前面', link: '/数据库/README.md',

                    },
                    {
                        text: 'mySQL', items: [
                            {text: '入门到进阶', link: '/数据库/mysql/sql-个人.md'},
                        ]
                    },
                    {
                        text: 'redis', items: [
                            {text: '入门到进阶', link: '/数据库/redis/Redis-狂神.md'},
                        ]
                    },
                    {
                        text: 'Hbase', items: [
                            {text: '入门到进阶', link: '/数据库/Hbase/尚硅谷/Hbase.md'},
                        ]
                    },
                ]
            },

            {
                text: '运维部署',
                items: [
                    {
                        text: '写在前面', link: '/运维部署/README.md',

                    },
                    {
                        text: 'Linux', items: [
                            {text: 'Linux使用', link: '/运维部署/Linux/狂神/Linux使用.md'},
                        ]
                    },
                    {
                        text: 'Docker部署', items: [
                            {text: 'DockerFile', link: '/运维部署/Docker知识/狂神/Docker_file.md'},
                            {text: 'DockerCompose', link: '/运维部署/Docker知识/狂神/Docker_compose.md'},
                        ]
                    },
                    {
                        text: 'Git版本控制', items: [
                            {text: 'Git', link: '/运维部署/git/git.md'},
                        ]
                    },
                ]
            },

            {
                text: '资源安装',
                items: [
                    {text: 'StudioOne7安装教程', link: '资源安装/StudioOne7音频分离安装教程.md'},
                    {text: 'cubase教程.md', link: '资源安装/win安装cubase教程.md'},
                    {text: 'win安装studio one7最新教程', link: '资源安装/win安装studio one 7 最新教程.md'},
                ]
            },
            {
                text: '游玩攻略篇',
                items: [
                    {text: '上海周游计划', link: '游玩攻略篇/上海周游计划.md'},
                    {text: '小小华山-拿下!', link: '游玩攻略篇/小小华山-拿下!.md'},
                ]
            },
            {
                text: '杂项',link:'杂项/第一天.md'
                // items: [
                //     {text: '上海周游计划', link: '游玩攻略篇/上海周游计划.md'},
                //     {text: '小小华山-拿下!', link: '游玩攻略篇/小小华山-拿下!.md'},
                // ]
            },
            {
                text: '周记',link:'/周报/2025年10月第三周周报.md'
                // items: [
                //     {text: '上海周游计划', link: '游玩攻略篇/上海周游计划.md'},
                //     {text: '小小华山-拿下!', link: '游玩攻略篇/小小华山-拿下!.md'},
                // ]
            },

        ],

        // 侧边栏配置,侧边栏组，不同（导航）页面对应不同的侧边栏
        // 以对象形式配置，前边的key为nav处的路径,后边提供一个数组作为此侧边栏中的子标题
        sidebar: {
            "/AboutMe/": set_sidebar("/AboutMe/"),
            "/java后端/入门/": set_sidebar("/java后端/入门/"),
            "/java后端/SpringCloud/": set_sidebar("/java后端/SpringCloud/"),
            "/java后端/高级": set_sidebar("/java后端/高级"),
            "/java后端/权限框架": set_sidebar("/java后端/权限框架"),
            "/java后端/java数据库框架": set_sidebar("/java后端/java数据库框架"),
            "/前端/基础/": set_sidebar("/前端/基础/"),
            "/前端/入门": set_sidebar("/前端/入门"),
            "/运维部署/": set_sidebar("/运维部署/"),
            "/数据库/mysql/sql-个人": set_sidebar("/数据库/mysql/"),
            "/数据库/mysql/": set_sidebar("/数据库/mysql/"),
            "/数据库/redis/": set_sidebar("/数据库/redis/"),
            "/数据库/Hbase/": set_sidebar("/数据库/Hbase/"),
            // "/git/": set_sidebar("/git/"),
            "/bigdata/hbase/": set_sidebar("/bigdata/hbase/"),
            "/bigdata/hadoop/": set_sidebar("/bigdata/hadoop/"),
            "资源安装": set_sidebar("资源安装"),
            "游玩攻略篇": set_sidebar("游玩攻略篇"),
            "杂项": set_sidebar("杂项"),
            "周报": set_sidebar("周报"),
        },

        socialLinks: [
            {icon: 'github', link: 'https://github.com/vuejs/vitepress'},
            {
                icon: {
                    svg: '<svg t="1763894170611" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5041" width="200" height="200"><path d="M512 1024C229.222 1024 0 794.778 0 512S229.222 0 512 0s512 229.222 512 512-229.222 512-512 512z m259.149-568.883h-290.74a25.293 25.293 0 0 0-25.292 25.293l-0.026 63.206c0 13.952 11.315 25.293 25.267 25.293h177.024c13.978 0 25.293 11.315 25.293 25.267v12.646a75.853 75.853 0 0 1-75.853 75.853h-240.23a25.293 25.293 0 0 1-25.267-25.293V417.203a75.853 75.853 0 0 1 75.827-75.853h353.946a25.293 25.293 0 0 0 25.267-25.292l0.077-63.207a25.293 25.293 0 0 0-25.268-25.293H417.152a189.62 189.62 0 0 0-189.62 189.645V771.15c0 13.977 11.316 25.293 25.294 25.293h372.94a170.65 170.65 0 0 0 170.65-170.65V480.384a25.293 25.293 0 0 0-25.293-25.267z" fill="#C71D23" p-id="5042"></path></svg>'
                },
                link: 'https://gitee.com/yhstu',
            },
            {
                icon: {
                    svg: '<svg t="1763894297580" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6051" width="200" height="200"><path d="M512 1024C229.2224 1024 0 794.7776 0 512 0 229.2224 229.2224 0 512 0c282.7776 0 512 229.2224 512 512 0 282.7776-229.2224 512-512 512z m17.066667-413.525333c34.850133 4.352 68.778667 5.12 102.741333 2.0992 23.04-2.048 44.817067-8.362667 64.170667-21.9136 38.212267-26.794667 49.783467-85.1968 24.251733-123.050667-14.626133-21.7088-36.8128-30.344533-60.757333-35.498667-35.054933-7.543467-70.4512-5.751467-105.847467-3.413333-5.666133 0.3584-6.7584 3.072-7.236267 8.209067-3.072 32.682667-6.536533 65.314133-9.813333 97.962666-2.5088 24.814933-4.932267 49.629867-7.509333 75.605334z m53.4016-33.928534c1.962667-20.906667 3.6352-39.338667 5.4272-57.770666 1.553067-15.906133 3.413333-31.778133 4.727466-47.701334 0.3584-4.283733 1.553067-6.656 5.956267-6.382933 15.616 1.041067 31.709867 0.034133 46.728533 3.652267 36.488533 8.823467 48.725333 54.306133 23.3472 83.029333-15.8208 17.902933-36.7616 23.586133-59.255466 25.088-8.465067 0.546133-17.015467 0.085333-26.9312 0.085333zM512 434.295467c-2.184533-0.648533-3.5328-1.1776-4.932267-1.4336-37.717333-6.877867-75.690667-8.328533-113.646933-2.816-20.974933 3.037867-41.0112 9.489067-57.480533 23.330133-22.9888 19.319467-21.640533 46.848 4.4032 62.0032 13.056 7.594667 28.023467 12.509867 42.5984 17.288533 14.08 4.608 28.996267 6.826667 43.144533 11.264 12.5952 3.925333 14.011733 14.318933 3.584 22.306134-3.345067 2.56-7.441067 5.085867-11.537067 5.751466-11.195733 1.826133-22.698667 4.386133-33.826133 3.566934-24.098133-1.774933-48.042667-5.461333-72.5504-8.430934-1.365333 10.615467-2.935467 23.0912-4.5568 35.9424 4.181333 1.365333 7.68 2.730667 11.264 3.618134 33.9456 8.4992 68.386133 9.608533 102.912 5.12 20.087467-2.6112 39.4752-7.901867 56.695467-19.029334 28.603733-18.4832 36.693333-57.1904-4.676267-75.383466-14.506667-6.382933-30.190933-10.410667-45.482667-15.086934-11.4176-3.4816-23.313067-5.614933-34.525866-9.5232-9.7792-3.413333-11.144533-12.202667-3.037867-18.397866 4.6592-3.549867 10.717867-6.997333 16.384-7.3728a480.853333 480.853333 0 0 1 53.384533-0.853334c15.377067 0.699733 30.651733 3.549867 46.4896 5.5296L512 434.295467z m257.143467 2.048L750.933333 614.2976h54.152534c4.778667-45.636267 9.710933-90.7264 14.062933-135.8848 0.6144-6.365867 2.3552-8.840533 8.686933-9.0112 11.434667-0.273067 22.8864-1.979733 34.286934-1.570133 23.722667 0.853333 42.3936 9.728 38.4 43.264-2.901333 24.2688-5.597867 48.571733-8.2432 72.874666-1.092267 10.069333-1.826133 20.189867-2.730667 30.4128h55.330133c3.584-35.259733 7.9872-70.058667 10.496-104.994133 3.413333-47.4624-17.7664-73.3184-64.682666-80.213333-40.96-6.007467-81.339733-0.341333-121.5488 7.133866z m-483.498667 134.6048c-8.738133 1.297067-16.384 2.798933-24.098133 3.4816-25.6512 2.235733-51.319467 3.9424-76.305067-4.266667-13.909333-4.590933-24.6784-12.578133-29.7984-25.9584-7.901867-20.701867 0.887467-47.104 19.831467-60.3136 17.373867-12.117333 37.717333-15.9232 58.453333-15.9232 22.545067-0.017067 45.090133 2.423467 68.232533 3.84L307.2 432.298667c-15.069867-1.723733-29.4912-3.925333-43.997867-4.9152-41.0112-2.798933-80.64 2.6112-117.469866 20.462933-30.020267 14.557867-52.053333 36.010667-58.6752 68.130133-7.850667 38.144 11.537067 69.495467 51.7632 85.845334 19.1488 7.765333 39.287467 12.509867 60.0064 12.5952 24.746667 0.1024 49.493333-1.570133 74.205866-2.952534 3.106133-0.170667 8.311467-2.901333 8.669867-5.034666 1.979733-11.554133 2.730667-23.278933 3.9424-35.464534z" fill="#DD1700" p-id="6052"></path></svg>'
                },
                link: 'https://blog.csdn.net/qq_47913744?spm=1000.2115.3001.5343'
            },
            {
                icon: {
                    svg: '<svg t="1763894331950" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7091" width="200" height="200"><path d="M338.048 349.248" fill="#d81e06" p-id="7092"></path><path d="M521.6256 53.4528c-260.5056 0-471.6544 211.1488-471.6544 471.6544s211.1488 471.6544 471.6544 471.6544 471.6544-211.1488 471.6544-471.6544S782.1312 53.4528 521.6256 53.4528zM741.92213333 670.85653333c-19.2512 55.02293333-72.63573333 107.24693333-135.85066666 131.4816-33.51893333 13.17546667-101.23946667 17.6128-138.0352 8.8064C302.42133333 772.57386667 217.77066667 563.06346667 306.31253333 411.78453333c29.14986667-50.03946667 108.3392-117.69173333 137.48906667-117.69173333 6.62186667 0 16.52053333 4.98346667 21.43573333 10.4448 17.6128 19.2512 8.8064 33.5872-38.5024 67.10613333-67.10613333 47.85493333-96.256 101.7856-96.256 177.69813334 0 61.57653333 23.07413333 114.41493333 69.29066667 156.74026666 37.95626667 34.67946667 68.1984 46.76266667 121.0368 47.3088 73.728 0 126.49813333-31.3344 157.2864-93.52533333 16.52053333-33.51893333 17.06666667-37.95626667 14.88213333-84.71893333-2.18453333-42.32533333-4.36906667-52.77013333-18.70506666-75.3664-15.42826667-24.7808-62.6688-58.84586667-70.92906667-51.13173334-1.6384 2.18453333 1.6384 23.07413333 8.26026667 46.76266667 6.07573333 23.68853333 10.99093333 47.85493333 10.99093333 53.93066667 0 44.57813333-34.67946667 90.7264-76.45866667 102.33173333-70.92906667 19.2512-128.68266667-35.2256-128.68266666-121.58293333 0-59.93813333 29.696-105.0624 84.71893333-129.77493334l19.79733333-8.8064-2.18453333-47.3088c-2.73066667-42.87146667-1.6384-48.9472 9.35253333-63.2832 26.96533333-33.51893333 70.92906667-45.6704 108.3392-29.696 22.528 9.35253333 45.6704 32.42666667 45.6704 45.12426667 0 12.62933333-14.88213333 30.78826667-25.32693333 30.78826667-3.82293333 0-17.06666667-4.9152-29.14986667-11.53706667-26.96533333-13.7216-39.04853333-12.0832-49.49333333 6.62186667-6.62186667 12.0832-7.168 18.70506667-1.6384 36.864 6.07573333 20.34346667 8.8064 22.528 32.9728 28.60373333 62.12266667 14.88213333 103.97013333 52.224 128.68266667 114.96106667C755.0976 543.26613333 756.80426667 629.62346667 741.92213333 670.85653333z" fill="#d81e06" p-id="7093"></path><path d="M503.168 472.128c-16.512 10.304-33.024 42.304-33.024 65.472 0 19.584 13.44 46.912 25.792 53.632 22.656 12.352 56.704-8.768 56.704-35.072 0-7.744-4.096-32-8.768-54.144C533.568 458.176 529.984 455.616 503.168 472.128z" fill="#d81e06" p-id="7094"></path></svg>'
                },
                link: 'https://music.163.com/#/artist/album?id=34597186'
            },

            {icon: 'CSDN', link: 'https://github.com/vuejs/vitepress'},
            {icon: '我的网易云', link: 'https://github.com/vuejs/vitepress'}
        ],
        footer: {
            copyright: "Copyright © 2025-present Evan You"
        },
        // 设置搜索框的样式
        search: {
            provider: "local",
            options: {
                translations: {
                    button: {
                        buttonText: "搜索文档",
                        buttonAriaLabel: "搜索文档",
                    },
                    modal: {
                        noResultsText: "无法找到相关结果",
                        resetButtonTitle: "清除查询条件",
                        footer: {
                            selectText: "选择",
                            navigateText: "切换",
                        },
                    },
                },
            },
        },
    },

})
